Revit 2027 API
ParameterTypeId.PlumbingFixturesSupplyFitting Property
 "Supply Fitting"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PlumbingFixturesSupplyFitting { get; }
Public Shared ReadOnly Property PlumbingFixturesSupplyFitting As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PlumbingFixturesSupplyFitting {
	ForgeTypeId^ get ();
}
static member PlumbingFixturesSupplyFitting : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace